[
  {
    "type": "StyleGuide",
    "name": "UI & UX",
    "summary": "Information regarding the UI and UX implementation",
    "image": "ux-ui-00.png",

    "points": {
      "Strengths": [],
      "Weaknesses": [],
      "Opportunities": [],
      "Threats": []
    }
  },
  {
    "type": "StyleGuide",
    "name": "Typography",
    "summary": "Analysing the typography",
    "points": {
      "Font choice": [],
      "Sizing": [],
      "Text alignment": []
    },
    "image": "typography.png"
  },

  {
    "type": "StyleGuide",
    "name": "Colour Theory",
    "summary": "Analysing the colours present in the site",
    "points": {
      "Primary colour": [],
      "Accent colours": [],
      "Other colours": []
    },
    "image": "colour.png"
  },
  {
    "type": "StyleGuide",
    "name": "Design Principles",
    "summary": "Critiquing basic design principles",
    "points": {
      "Balance": [],
      "Contrast": [],
      "Emphasis": [],
      "Movement": [],
      "Rhythm": [],
      "White Space": [],

      "Unity": [],
      "Variety": [],
      "Proportion": [],
      "Hierarchy": [],
      "Proximity": [],
      "Repitition": []
    },
    "image": "principles.png"
  },

  {
    "type": "StyleGuide",
    "name": "Images, Icons and Buttons",
    "summary": "Discussing the graphic imagery and buttons",
    "points": {
      "Images": [],
      "Icons": [],
      "Buttons": []
    },
    "image": "icons.png"
  },

  {
    "type": "StyleGuide",
    "name": "S.W.O.T.",
    "summary": "Performing a S.W.O.T. of all the design choices",
    "points": {
      "Strengths": [
        "User-Centered Approach: The website prioritizes user exploration with a clear profile introduction and intuitive navigation. This empowers users to discover content at their own pace.",
        "Focus on Readability: Classic Arial font and a black background with bright colors promote readability and reduce eye strain for a comfortable browsing experience.",
        "Accessibility Considerations: The focus on clear hierarchy, navigation labeling, and potential exploration of color contrast for accessibility ensures the website is inclusive for all users.",
        "Music Themed Navigation: Interactive music-related icons and buttons create a familiar and engaging experience, aligning with the website's overall theme."
      ],
      "Weaknesses": [
        "Limited Information Density: To avoid information overload, individual pages might lack detailed content. This could require users to navigate to multiple pages to find comprehensive information.",
        "Dependence on Profile Page: The entire user journey hinges on a well-crafted profile page. If the introduction isn't captivating enough, users may not be motivated to explore further.",
        "Potential for Monotony: A focus on clean layouts and uncluttered pages might lead to a lack of visual interest on some pages, especially if not balanced with engaging visuals or design elements."
      ],
      "Opportunities": [
        "Content Depth: Consider incorporating features like expandable sections, pop-ups, or dedicated 'deep dive' pages to offer more detailed information without overwhelming users on the main pages.",
        "Multimedia Integration: Embedding audio samples, music videos, or interactive playlists could further enhance the user experience and create a more immersive musical exploration.",
        "Community Features: Adding comment sections, forums, or social media integration could foster interaction and a sense of community among music fans."
      ],
      "Threats": [
        "Competition: The music website landscape is crowded. A clear and differentiated value proposition, along with engaging content, is crucial to stand out.",
        "Attention Spans: Modern users have short attention spans. Consider incorporating design elements that capture attention quickly and encourage continued exploration.",
        "Technical Challenges: Implementing interactive elements, multimedia content, or user-generated content features requires careful planning and technical expertise to ensure smooth functionality."
      ]
    },
    "content": "",
    "image": "style-guide.png"
  }
]
